tests/suite-root-url-test/60000-conc-2000/ab_report.txt
This is ApacheBench, Version 2.3 <$Revision: 1528965 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 10.0.0.14 (be patient)


Server Software:        WEBrick/1.3.1
Server Hostname:        10.0.0.14
Server Port:            80

Document Path:          /
Document Length:        547 bytes

Concurrency Level:      2000
Time taken for tests:   924.532 seconds
Complete requests:      60000
Failed requests:        35697
   (Connect: 0, Receive: 0, Length: 35697, Exceptions: 0)
Non-2xx responses:      35697
Keep-Alive requests:    60000
Total transferred:      32418528 bytes
HTML transferred:       15685440 bytes
Requests per second:    64.90 [#/sec] (mean)
Time per request:       30817.746 [ms] (mean)
Time per request:       15.409 [ms] (mean, across all concurrent requests)
Transfer rate:          34.24 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    5  61.2      0    1002
Processing:   249 29396 15396.9  28622  184500
Waiting:      249 29396 15396.9  28617  184500
Total:        287 29401 15391.3  28622  184500

Percentage of the requests served within a certain time (ms)
  50%  28622
  66%  35709
  75%  39636
  80%  41510
  90%  44524
  95%  50934
  98%  62626
  99%  74366
 100%  184500 (longest request)